Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32F746G-DISCO.c
PG13, // |RMII_TXD0 [LAN8742A-CZ-TR_TXD0]        |    |    |    |    |     |     |     |     |     |*SCK |      |      |      |      |     |                                          |          |          |+TRACED0   
PG14, // |RMII_TXD1 [LAN8742A-CZ-TR_TXD1]        |    |    |    |    |     |     |     |     |     |*MOSI|      |      |      |*TX   |     |                                          |          |          |+TRACED1   
PG15, // |FMC_SDNCAS [MT48LC4M32B2B5-6A_CAS]     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH0 , // |OSC_25M [NZ2520SB-25.00M_OUT]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*OSC_IN   |           
PH1 , // |                                       |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*OSC_OUT  |           
PH2 , // |NC2                                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+LPTIM1_IN2                               |          |          |           
PH3 , // |FMC_SDNE0 [MT48LC4M32B2B5-6A_CS]       |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH4 , // |ULPI_NXT [USB3320C-EZK_NXT]            |    |+SCL|    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH5 , // |FMC_SDNME [MT48LC4M32B2B5-6A_WE]       |    |+SDA|    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH6 , // |ARDUINO PWM/D6                         |    |    |    |    |     |     |     |     |+SCK |     |      |      |      |      |     |*TIM12_CH1                                |          |          |           
PH7 , // |LCD_SCL [RK043FN48H-CT672B_SCL]        |    |    |+SCL|    |     |     |     |     |+MISO|     |      |      |      |      |     |                                          |          |          |           
PH8 , // |LCD_SDA [RK043FN48H-CT672B_SDA]        |    |    |+SDA|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH9 , // |DCMI_D0                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM12_CH2                                |          |          |           
PH10, // |DCMI_D1                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM5_CH1                                 |          |          |           
PH11, // |DCMI_D2                                |    |    |    |+SCL|     |     |     |     |     |     |      |      |      |      |     |+TIM5_CH2                                 |          |          |           
PH12, // |DCMI_D3                                |    |    |    |+SDA|     |     |     |     |     |     |      |      |      |      |     |*TIM5_CH3                                 |          |          |           
PH13, // |DCMI_PWR_EN                            |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH1N                                |          |          |           
PH14, // |DCMI_D4                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH2N                                |          |          |           
PH15, // |TP3                                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH3N                                |          |          |           
PI0 , // |ARDUINO PWM/CS/D10                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM5_CH4                                 |          |          |           
PI1 , // |ARDUINO SCK/D13                        |    |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI2 , // |ARDUINO D8                             |    |    |    |    |     |*MISO|     |     |     |     |      |      |      |      |     |*TIM8_CH4                                 |          |          |           
PI3 , // |ARDUINO D7                             |    |    |    |    |     |*MOSI|     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI4 , // |SAI2_MCLKA [WM8994ECS/R_MCLK1]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI5 , // |SAI2_SCKA [WM8994ECS/R_BCLK1]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH1                                 |          |          |           
PI6 , // |SAI2_SDA [WM8994ECS/R_DACDAT1]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH2                                 |          |          |           
PI7 , // |SAI2_FSA [WM8994ECS/R_LRCLK1]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH3                                 |          |          |           
PI8 , // |NC1 [TP2]                              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI9 , // |LCD_VSYNC [RK043FN48H-CT672B_VSYNC]    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI10, // |LCD_HSYNC [RK043FN48H-CT672B_HSYNC]    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI11, // |                                       |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI12, // |LCD_DISP [RK043FN48H-CT672B_DISP]      |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI13, // |LCD_INT                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI14, // |LCD_CLK [RK043FN48H-CT672B_CLK]        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI15, // |LCD_R0 [RK043FN48H-CT672B_R0]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ0 , // |LCD_R1 [RK043FN48H-CT672B_R1]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ1 , // |LCD_R2 [RK043FN48H-CT672B_R2]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ2 , // |LCD_R3 [RK043FN48H-CT672B_R3]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ3 , // |LCD_R4 [RK043FN48H-CT672B_R4]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ4 , // |LCD_R5 [RK043FN48H-CT672B_R5]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ5 , // |LCD_R6 [RK043FN48H-CT672B_R6]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ6 , // |LCD_R7 [RK043FN48H-CT672B_R7]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ7 , // |LCD_G0 [RK043FN48H-CT672B_G0]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ8 , // |LCD_G1 [RK043FN48H-CT672B_G1]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ9 , // |LCD_G2 [RK043FN48H-CT672B_G2]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ10, // |LCD_G3 [RK043FN48H-CT672B_G3]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ11, // |LCD_G4 [RK043FN48H-CT672B_G4]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ12, // |OTG_FS_VBUS                            |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ13, // |LCD_B1 [RK043FN48H-CT672B_B1]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ14, // |LCD_B2 [RK043FN48H-CT672B_B2]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ15, // |LCD_B3 [RK043FN48H-CT672B_B3]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK0 , // |LCD_G5 [RK043FN48H-CT672B_G5]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK1 , // |LCD_G6 [RK043FN48H-CT672B_G6]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK2 , // |LCD_G7 [RK043FN48H-CT672B_G7]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK3 , // |LCD_BL_CTRL [STLD40DPUR_EN]            |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK4 , // |LCD_B5 [RK043FN48H-CT672B_B5]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK5 , // |LCD_B6 [RK043FN48H-CT672B_B6]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK6 , // |LCD_B7 [RK043FN48H-CT672B_B7]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK7 , // |LCD_DE [RK043FN48H-CT672B_DE]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB11, GPIO_PIN_11, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD0 , GPIO_PIN_0 , GPIOD, GPIO_PIN_IO, false},
  { PD1 , GPIO_PIN_1 , GPIOD, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PD3 , GPIO_PIN_3 , GPIOD, GPIO_PIN_IO, false},
  { PD4 , GPIO_PIN_4 , GPIOD, GPIO_PIN_IO, false},
  { PD5 , GPIO_PIN_5 , GPIOD, GPIO_PIN_IO, false},
  { PD6 , GPIO_PIN_6 , GPIOD, GPIO_PIN_IO, false},
  { PD7 , GPIO_PIN_7 , GPIOD, GPIO_PIN_IO, false},
  { PD8 , GPIO_PIN_8 , GPIOD, GPIO_PIN_IO, false},
  { PD9 , GPIO_PIN_9 , GPIOD, GPIO_PIN_IO, false},
  { PD10, GPIO_PIN_10, GPIOD, GPIO_PIN_IO, false},
  { PD11, GPIO_PIN_11, GPIOD, GPIO_PIN_IO, false},
  { PD12, GPIO_PIN_12, GPIOD, GPIO_PIN_IO, false},
  { PD13, GPIO_PIN_13, GPIOD, GPIO_PIN_IO, false},
  { PD14, GPIO_PIN_14, GPIOD, GPIO_PIN_IO, false},
  { PD15, GPIO_PIN_15, GPIOD, GPIO_PIN_IO, false},
  { PE0 , GPIO_PIN_0 , GPIOE, GPIO_PIN_IO, false},
  { PE1 , GPIO_PIN_1 , GPIOE, GPIO_PIN_IO, false},
  { PE2 , GPIO_PIN_2 , GPIOE, GPIO_PIN_IO, false},
  { PE3 , GPIO_PIN_3 , GPIOE, GPIO_PIN_IO, false},
  { PE4 , GPIO_PIN_4 , GPIOE, GPIO_PIN_IO, false},
  { PE5 , GPIO_PIN_5 , GPIOE, GPIO_PIN_IO, false},
  { PE6 , GPIO_PIN_6 , GPIOE, GPIO_PIN_IO, false},
  { PE7 , GPIO_PIN_7 , GPIOE, GPIO_PIN_IO, false},
  { PE8 , GPIO_PIN_8 , GPIOE, GPIO_PIN_IO, false},
  { PE9 , GPIO_PIN_9 , GPIOE, GPIO_PIN_IO, false},
  { PE10, GPIO_PIN_10, GPIOE, GPIO_PIN_IO, false},
  { PE11, GPIO_PIN_11, GPIOE, GPIO_PIN_IO, false},
  { PE12, GPIO_PIN_12, GPIOE, GPIO_PIN_IO, false},
  { PE13, GPIO_PIN_13, GPIOE, GPIO_PIN_IO, false},
  { PE14, GPIO_PIN_14, GPIOE, GPIO_PIN_IO, false},
  { PE15, GPIO_PIN_15, GPIOE, GPIO_PIN_IO, false},
  { PF0 , GPIO_PIN_0 , GPIOF, GPIO_PIN_IO, false},
  { PF1 , GPIO_PIN_1 , GPIOF, GPIO_PIN_IO, false},
  { PF2 , GPIO_PIN_2 , GPIOF, GPIO_PIN_IO, false},
  { PF3 , GPIO_PIN_3 , GPIOF, GPIO_PIN_IO, false},
  { PF4 , GPIO_PIN_4 , GPIOF, GPIO_PIN_IO, false},
  { PF5 , GPIO_PIN_5 , GPIOF, GPIO_PIN_IO, false},
  { PF6 , GPIO_PIN_6 , GPIOF, GPIO_PIN_IO, false},
  { PF7 , GPIO_PIN_7 , GPIOF, GPIO_PIN_IO, false},
  { PF8 , GPIO_PIN_8 , GPIOF, GPIO_PIN_IO, false},
  { PF9 , GPIO_PIN_9 , GPIOF, GPIO_PIN_IO, false},
  { PF10, GPIO_PIN_10, GPIOF, GPIO_PIN_IO, false},
  { PF11, GPIO_PIN_11, GPIOF, GPIO_PIN_IO, false},
  { PF12, GPIO_PIN_12, GPIOF, GPIO_PIN_IO, false},
  { PF13, GPIO_PIN_13, GPIOF, GPIO_PIN_IO, false},
  { PF14, GPIO_PIN_14, GPIOF, GPIO_PIN_IO, false},
  { PF15, GPIO_PIN_15, GPIOF, GPIO_PIN_IO, false},
  { PG0 , GPIO_PIN_0 , GPIOG, GPIO_PIN_IO, false},
  { PG1 , GPIO_PIN_1 , GPIOG, GPIO_PIN_IO, false},
  { PG2 , GPIO_PIN_2 , GPIOG, GPIO_PIN_IO, false},
  { PG3 , GPIO_PIN_3 , GPIOG, GPIO_PIN_IO, false},
  { PG4 , GPIO_PIN_4 , GPIOG, GPIO_PIN_IO, false},
  { PG5 , GPIO_PIN_5 , GPIOG, GPIO_PIN_IO, false},
  { PG6 , GPIO_PIN_6 , GPIOG, GPIO_PIN_IO, false},
  { PG7 , GPIO_PIN_7 , GPIOG, GPIO_PIN_IO, false},
  { PG8 , GPIO_PIN_8 , GPIOG, GPIO_PIN_IO, false},
  { PG9 , GPIO_PIN_9 , GPIOG, GPIO_PIN_IO, false},
  { PG10, GPIO_PIN_10, GPIOG, GPIO_PIN_IO, false},
  { PG11, GPIO_PIN_11, GPIOG, GPIO_PIN_IO, false},
  { PG12, GPIO_PIN_12, GPIOG, GPIO_PIN_IO, false},
  { PG13, GPIO_PIN_13, GPIOG, GPIO_PIN_IO, false},
  { PG14, GPIO_PIN_14, GPIOG, GPIO_PIN_IO, false},
  { PG15, GPIO_PIN_15, GPIOG, GPIO_PIN_IO, false},
  { PH0 , GPIO_PIN_0 , GPIOH, GPIO_PIN_IO, false},
  { PH1 , GPIO_PIN_1 , GPIOH, GPIO_PIN_IO, false},
  { PH2 , GPIO_PIN_2 , GPIOH, GPIO_PIN_IO, false},
  { PH3 , GPIO_PIN_3 , GPIOH, GPIO_PIN_IO, false},
  { PH4 , GPIO_PIN_4 , GPIOH, GPIO_PIN_IO, false},
  { PH5 , GPIO_PIN_5 , GPIOH, GPIO_PIN_IO, false},
  { PH6 , GPIO_PIN_6 , GPIOH, GPIO_PIN_IO, false},
  { PH7 , GPIO_PIN_7 , GPIOH, GPIO_PIN_IO, false},
  { PH8 , GPIO_PIN_8 , GPIOH, GPIO_PIN_IO, false},
  { PH9 , GPIO_PIN_9 , GPIOH, GPIO_PIN_IO, false},
  { PH10, GPIO_PIN_10, GPIOH, GPIO_PIN_IO, false},
  { PH11, GPIO_PIN_11, GPIOH, GPIO_PIN_IO, false},
  { PH12, GPIO_PIN_12, GPIOH, GPIO_PIN_IO, false},
  { PH13, GPIO_PIN_13, GPIOH, GPIO_PIN_IO, false},
  { PH14, GPIO_PIN_14, GPIOH, GPIO_PIN_IO, false},
  { PH15, GPIO_PIN_15, GPIOH, GPIO_PIN_IO, false},
  { PI0 , GPIO_PIN_0 , GPIOI, GPIO_PIN_IO, false},
  { PI1 , GPIO_PIN_1 , GPIOI, GPIO_PIN_IO, false},
  { PI2 , GPIO_PIN_2 , GPIOI, GPIO_PIN_IO, false},
  { PI3 , GPIO_PIN_3 , GPIOI, GPIO_PIN_IO, false},
  { PI4 , GPIO_PIN_4 , GPIOI, GPIO_PIN_IO, false},
  { PI5 , GPIO_PIN_5 , GPIOI, GPIO_PIN_IO, false},
  { PI6 , GPIO_PIN_6 , GPIOI, GPIO_PIN_IO, false},
  { PI7 , GPIO_PIN_7 , GPIOI, GPIO_PIN_IO, false},
  { PI8 , GPIO_PIN_8 , GPIOI, GPIO_PIN_IO, false},
  { PI9 , GPIO_PIN_9 , GPIOI, GPIO_PIN_IO, false},
  { PI10, GPIO_PIN_10, GPIOI, GPIO_PIN_IO, false},
  { PI11, GPIO_PIN_11, GPIOI, GPIO_PIN_IO, false},
  { PI12, GPIO_PIN_12, GPIOI, GPIO_PIN_IO, false},
  { PI13, GPIO_PIN_13, GPIOI, GPIO_PIN_IO, false},
  { PI14, GPIO_PIN_14, GPIOI, GPIO_PIN_IO, false},
  { PI15, GPIO_PIN_15, GPIOI, GPIO_PIN_IO, false},
  { PJ0 , GPIO_PIN_0 , GPIOJ, GPIO_PIN_IO, false},
  { PJ1 , GPIO_PIN_1 , GPIOJ, GPIO_PIN_IO, false},
  { PJ2 , GPIO_PIN_2 , GPIOJ, GPIO_PIN_IO, false},
  { PJ3 , GPIO_PIN_3 , GPIOJ, GPIO_PIN_IO, false},
  { PJ4 , GPIO_PIN_4 , GPIOJ, GPIO_PIN_IO, false},
  { PJ5 , GPIO_PIN_5 , GPIOJ, GPIO_PIN_IO, false},
  { PJ6 , GPIO_PIN_6 , GPIOJ, GPIO_PIN_IO, false},
  { PJ7 , GPIO_PIN_7 , GPIOJ, GPIO_PIN_IO, false},
  { PJ8 , GPIO_PIN_8 , GPIOJ, GPIO_PIN_IO, false},
  { PJ9 , GPIO_PIN_9 , GPIOJ, GPIO_PIN_IO, false},
  { PJ10, GPIO_PIN_10, GPIOJ, GPIO_PIN_IO, false},
  { PJ11, GPIO_PIN_11, GPIOJ, GPIO_PIN_IO, false},
  { PJ12, GPIO_PIN_12, GPIOJ, GPIO_PIN_IO, false},
  { PJ13, GPIO_PIN_13, GPIOJ, GPIO_PIN_IO, false},
  { PJ14, GPIO_PIN_14, GPIOJ, GPIO_PIN_IO, false},
  { PJ15, GPIO_PIN_15, GPIOJ, GPIO_PIN_IO, false},
  { PK0 , GPIO_PIN_0 , GPIOK, GPIO_PIN_IO, false},
  { PK1 , GPIO_PIN_1 , GPIOK, GPIO_PIN_IO, false},
  { PK2 , GPIO_PIN_2 , GPIOK, GPIO_PIN_IO, false},
  { PK3 , GPIO_PIN_3 , GPIOK, GPIO_PIN_IO, false},
  { PK4 , GPIO_PIN_4 , GPIOK, GPIO_PIN_IO, false},
  { PK5 , GPIO_PIN_5 , GPIOK, GPIO_PIN_IO, false},
  { PK6 , GPIO_PIN_6 , GPIOK, GPIO_PIN_IO, false},
  { PK7 , GPIO_PIN_7 , GPIOK, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF5_SPI1,
    .mosi_port = GPIOB, 
    .mosi_pin =  GPIO_PIN_5, 
    .miso_alternate = GPIO_AF5_SPI1,
    .miso_port = GPIOB, 
    .miso_pin = GPIO_PIN_4, 
    .sck_alternate = GPIO_AF5_SPI1,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_3, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF5_SPI2,
    .mosi_port = GPIOI, 
    .mosi_pin =  GPIO_PIN_3, 
    .miso_alternate = GPIO_AF5_SPI2,
    .miso_port = GPIOI, 
    .miso_pin = GPIO_PIN_2, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOD, 
    .sck_pin = GPIO_PIN_3, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI3, 
    .mosi_alternate = GPIO_AF6_SPI3,
    .mosi_port = GPIOB, 
    .mosi_pin =  GPIO_PIN_5, 
    .miso_alternate = GPIO_AF6_SPI3,
    .miso_port = GPIOB, 
    .miso_pin = GPIO_PIN_4, 
    .sck_alternate = GPIO_AF6_SPI3,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_3, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI4, 
    .mosi_alternate = GPIO_AF5_SPI4,
    .mosi_port = GPIOE, 
    .mosi_pin =  GPIO_PIN_6, 
    .miso_alternate = GPIO_AF5_SPI4,
    .miso_port = GPIOE, 
    .miso_pin = GPIO_PIN_5, 
    .sck_alternate = GPIO_AF5_SPI4,
    .sck_port = GPIOE, 
    .sck_pin = GPIO_PIN_2, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI5, 
    .mosi_alternate = GPIO_AF5_SPI5,
    .mosi_port = GPIOF, 
    .mosi_pin =  GPIO_PIN_9, 
    .miso_alternate = GPIO_AF5_SPI5,
    .miso_port = GPIOF, 
    .miso_pin = GPIO_PIN_8, 
    .sck_alternate = GPIO_AF5_SPI5,
    .sck_port = GPIOF, 
    .sck_pin = GPIO_PIN_7, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI6, 
    .mosi_alternate = GPIO_AF5_SPI6,
    .mosi_port = GPIOG, 
    .mosi_pin =  GPIO_PIN_14, 
    .miso_alternate = GPIO_AF5_SPI6,
    .miso_port = GPIOG, 
    .miso_pin = GPIO_PIN_12, 
    .sck_alternate = GPIO_AF5_SPI6,
    .sck_port = GPIOG, 
    .sck_pin = GPIO_PIN_13, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

